# Задача №1
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.


name = input("Ваше имя: ")
age = input("Ваш возраст: ")
print(f"Приветствую, {name}, вам сейчас {age} лет.")

